<template>
 <div style="margin-left: 10px; margin-right: 10px; height: 100%">
  <div class="line-div">
   <div class="com-chart" ref="accLineChart_ref"></div>
  </div>
 </div>
</template>

<script>
export default {
  name: "modelCompareAcc",
 data() {
  return {
   chartInstance: null,
   lineData: {
    bi_cls_1: [0.64210724, 0.69269121, 0.70780081, 0.72407412, 0.73780542,
     0.74562514, 0.75130305, 0.75817289, 0.76367508, 0.7669515 ,
     0.7713287 , 0.77368282, 0.7768336 , 0.77945104, 0.78340852,
     0.78433811, 0.78572753, 0.78717594, 0.79019825, 0.79118888,
     0.7926831 , 0.79539451, 0.79551516, 0.79729715, 0.80096071,
     0.80242337, 0.80396091, 0.80614137, 0.80733494, 0.80895235,
     0.80985855, 0.81206811, 0.81314753, 0.81216896, 0.81362712,
     0.81466603, 0.81339131, 0.81502354, 0.81318808, 0.81521154,
     0.81537351],
    bi_cls_2: [0.70096626, 0.78592022, 0.81452353, 0.84331851, 0.85593329,
     0.86653426, 0.87351903, 0.87955291, 0.88513035, 0.88861348,
     0.89293682, 0.89709874, 0.89934609, 0.90191729, 0.90461977,
     0.90825276, 0.9102031 , 0.91117773, 0.91454125, 0.91551439,
     0.91809309, 0.9178486 , 0.92081188, 0.92110798, 0.92251085,
     0.92456592, 0.92521889, 0.92545564, 0.92642588, 0.92738488,
     0.93054683, 0.92922372, 0.92913489, 0.92928133, 0.93177745,
     0.93080959, 0.93310762, 0.93355872, 0.93420717, 0.93408325,
     0.93507968, 0.93554788, 0.93681804, 0.93837889, 0.93873859,
     0.93977509, 0.94076757, 0.94005413, 0.94136962, 0.94242803,
     0.94095223, 0.94059745, 0.94090439, 0.94230319, 0.94138084,
     0.94253309, 0.94178008, 0.94289451],
    bi_pool_1: [0.68198084, 0.715253  , 0.73261831, 0.74469704, 0.75761049,
     0.76648854, 0.77681443, 0.78500879, 0.79207142, 0.79616288,
     0.80489756, 0.80950983, 0.81505987, 0.81913837, 0.82227624,
     0.82861976, 0.8315077 , 0.83373359, 0.8371915 , 0.84131477,
     0.84474666, 0.84902735, 0.84978078, 0.85368966, 0.8542091 ,
     0.85862005, 0.86158251, 0.86317405, 0.86559222, 0.86575037,
     0.86871324, 0.86951655, 0.87274297, 0.87269159, 0.87526957,
     0.87577568, 0.87686616, 0.87772024, 0.87969775, 0.87869461,
     0.8796981 , 0.88229151, 0.88142673],
    bi_pool_2: [0.75733965, 0.7995015 , 0.83205857, 0.85352668, 0.86479164,
     0.86985356, 0.87702523, 0.88219413, 0.88675809, 0.89040486,
     0.89298632, 0.89738696, 0.89964198, 0.90372252, 0.9049541 ,
     0.90749318, 0.90989965, 0.91175185, 0.91552832, 0.91637063,
     0.91906714, 0.92009646, 0.92235147, 0.92269732, 0.92539596,
     0.92703997, 0.9276239 , 0.92904051, 0.9303003 , 0.93089985,
     0.93114736, 0.93277395, 0.93520447, 0.9355701 , 0.93718774,
     0.93757329, 0.93798813, 0.94060821, 0.9403963 , 0.94148169,
     0.94349995, 0.94278734, 0.94390031, 0.94450634, 0.94567077,
     0.94656435, 0.94641484, 0.94998355, 0.94775926, 0.94866775,
     0.94833028, 0.94904654, 0.94834929, 0.94919325, 0.94969658,
     0.94968023, 0.95012273]
   }
  }
 },
 mounted () {
  this.initChart();
 },
 methods : {
  // 初始化echartsInstance对象
  initChart () {
   this.chartInstance = this.$echarts.init(this.$refs.accLineChart_ref);
   const initOption = {
    title: {
     top: '5%',
     text: '二分类模型AUC对比'
    },
    tooltip: {
     trigger: 'axis'
    },
    legend: {
     // data: ['二分类#CLS向量#并列关系', '二分类#CLS向量#转折关系', '二分类#MMP#并列关系', '二分类#MMP#转折关系', '多分类#CLS', '多分类#MMP']
     top: '5%'
    },
    grid: {
     left: '1%',
     right: '4%',
     bottom: '3%',
     top: '13%',
     containLabel: true
    },
    toolbox: {
     feature: {
      saveAsImage: {}
     }
    },
    xAxis: {
     type: 'category',
     boundaryGap: false,
     data: ['epoch0', 'epoch1', 'epoch2', 'epoch3', 'epoch4', 'epoch5', 'epoch6', 'epoch7',
      'epoch8','epoch9','epoch10','epoch11','epoch12','epoch13','epoch14',
      'epoch15','epoch16','epoch17','epoch18','epoch19','epoch20','epoch21',
      'epoch22','epoch23','epoch24','epoch25','epoch26','epoch27','epoch28',
      'epoch29','epoch30','epoch31','epoch32','epoch33','epoch34','epoch35',
      'epoch36','epoch37','epoch38','epoch39','epoch40','epoch41','epoch42',
      'epoch43','epoch44','epoch45','epoch46','epoch47','epoch48','epoch49',
      'epoch50','epoch51','epoch52','epoch53','epoch54','epoch55','epoch56', 'epoch57']
    },
    yAxis: {
     type: 'value'
    },
    series: [
     {
      name: '二分类#CLS#并列关系AUC',
      type: 'line',
      data: this.lineData.bi_cls_1
     },
     {
      name: '二分类#CLS#转折关系AUC',
      type: 'line',
      data: this.lineData.bi_cls_2
     },
     {
      name: '二分类#MMP#并列关系AUC',
      type: 'line',
      data: this.lineData.bi_pool_1
     },
     {
      name: '二分类#MMP#转折关系AUC',
      type: 'line',
      data: this.lineData.bi_pool_2
     },
    ]
   };
   this.chartInstance.setOption(initOption);
  },
 }
}
</script>

<style scoped>
 .el-row {
  margin-bottom: 5px;
 }
 .el-col {
  border-radius: 4px;
 }
 .step-font{
  font-weight: bold;
  font-family: 'Microsoft YaHei';
  margin-left: 0px;
  font-size: medium;
  color: dimgrey;
 }
 .el-divider {
  height: 1px;
  margin-top: 0px !important;
  margin-bottom: 10px !important;
 }
 .line-div {
  height: 90%;
  width: 100%;
  text-align: center;
 }
 .com-chart {
  width: 100%;
  height: 100%;
 }
</style>

