<template>
  <div style="margin-left: 10px; margin-right: 10px; height: 100%">
    <div class="line-div">
      <div class="com-chart" ref="lossLineChart_ref"></div>
    </div>
  </div>
</template>

<script>
export default {
  name: "modelCompareComponent",
  data() {
    return {
      chartInstance: null,
      lineData: {
        bi_cls_1: [0.66275001, 0.63612298, 0.62633171, 0.61524418, 0.60430397,
          0.59740642, 0.59239214, 0.58583522, 0.58049366, 0.57695364,
          0.57253491, 0.57004836, 0.56648017, 0.56376713, 0.55942114,
          0.55832467, 0.55612399, 0.55505023, 0.55195756, 0.55064924,
          0.54910968, 0.54600171, 0.54537363, 0.54381151, 0.5392195 ,
          0.53724087, 0.53567324, 0.53319021, 0.53171388, 0.53010248,
          0.52878124, 0.52637287, 0.52484262, 0.52539627, 0.52415524,
          0.52279772, 0.5243751 , 0.52176697, 0.52401   , 0.5216325 ,
          0.52152974],
        bi_cls_2: [0.6266286 , 0.55567859, 0.52390311, 0.48850366, 0.47072318,
          0.45555747, 0.44455362, 0.43514885, 0.42577575, 0.41974828,
          0.41211771, 0.40451179, 0.40063219, 0.3958486 , 0.39051893,
          0.38329351, 0.37881837, 0.37766273, 0.37044359, 0.36865547,
          0.36341157, 0.36352095, 0.35728227, 0.35671415, 0.35348653,
          0.34878964, 0.34735804, 0.34706175, 0.34469584, 0.34268976,
          0.3353928 , 0.33838792, 0.3386183 , 0.33792417, 0.33235753,
          0.33488453, 0.32919388, 0.3284644 , 0.32626386, 0.32679404,
          0.3242356 , 0.32311738, 0.31989455, 0.31591517, 0.31560917,
          0.31298453, 0.31010374, 0.31154508, 0.30840764, 0.30581681,
          0.30999946, 0.3108531 , 0.30970091, 0.30671873, 0.30852494,
          0.30609793, 0.30771862, 0.30483931],
        bi_pool_1: [0.642517  , 0.62094263, 0.60769965, 0.59779814, 0.58691933,
          0.57866995, 0.5692594 , 0.56088474, 0.55372184, 0.54887887,
          0.53943178, 0.53449007, 0.52814892, 0.52277643, 0.51913858,
          0.51094327, 0.5069526 , 0.50409903, 0.49993962, 0.4943599 ,
          0.48938078, 0.48375697, 0.4821406 , 0.47710207, 0.47587645,
          0.46930016, 0.46508348, 0.46286184, 0.45891018, 0.45894749,
          0.45403035, 0.45288674, 0.44795389, 0.4479397 , 0.44391615,
          0.44304076, 0.44151978, 0.44026596, 0.43747539, 0.43811808,
          0.43685196, 0.43264317, 0.43388214],
        bi_pool_2:  [0.5869024 , 0.54185222, 0.50377587, 0.47519027, 0.45839286,
          0.45059058, 0.43879245, 0.43065125, 0.42284504, 0.41635237,
          0.41164071, 0.40398494, 0.3995617 , 0.39207167, 0.38997306,
          0.38449316, 0.37976692, 0.37626893, 0.36857743, 0.36658225,
          0.36069838, 0.35854698, 0.35402535, 0.35282893, 0.34692562,
          0.34319305, 0.34168893, 0.33869116, 0.33516875, 0.33404728,
          0.3337994 , 0.32949916, 0.3239889 , 0.32304885, 0.31891026,
          0.31791838, 0.31736685, 0.31070071, 0.31062343, 0.30786334,
          0.30345071, 0.30472259, 0.30192531, 0.30019093, 0.29749088,
          0.29473244, 0.29494179, 0.28540729, 0.29168495, 0.28978743,
          0.29083338, 0.28835491, 0.29017936, 0.2882696 , 0.28682956,
          0.28696822, 0.28484605],
      }
    }
  },
  mounted () {
    this.initChart();
  },
  methods : {
    // 初始化echartsInstance对象
    initChart () {
      this.chartInstance = this.$echarts.init(this.$refs.lossLineChart_ref);
      const initOption = {
        title: {
          top: '5%',
          text: '二分类模型Loss对比'
        },
        tooltip: {
          trigger: 'axis'
        },
        legend: {
          // data: ['二分类#CLS向量#并列关系', '二分类#CLS向量#转折关系', '二分类#MMP#并列关系', '二分类#MMP#转折关系', '多分类#CLS', '多分类#MMP']
          top: '5%'
        },
        grid: {
          left: '1%',
          right: '4%',
          bottom: '3%',
          top: '13%',
          containLabel: true
        },
        toolbox: {
          feature: {
            saveAsImage: {}
          }
        },
        xAxis: {
          type: 'category',
          boundaryGap: false,
          data: ['epoch0', 'epoch1', 'epoch2', 'epoch3', 'epoch4', 'epoch5', 'epoch6', 'epoch7',
            'epoch8','epoch9','epoch10','epoch11','epoch12','epoch13','epoch14',
            'epoch15','epoch16','epoch17','epoch18','epoch19','epoch20','epoch21',
            'epoch22','epoch23','epoch24','epoch25','epoch26','epoch27','epoch28',
            'epoch29','epoch30','epoch31','epoch32','epoch33','epoch34','epoch35',
            'epoch36','epoch37','epoch38','epoch39','epoch40','epoch41','epoch42',
            'epoch43','epoch44','epoch45','epoch46','epoch47','epoch48','epoch49',
            'epoch50','epoch51','epoch52','epoch53','epoch54','epoch55','epoch56', 'epoch57']
        },
        yAxis: {
          type: 'value'
        },
        series: [
          {
            name: '二分类#CLS#并列关系',
            type: 'line',
            data: this.lineData.bi_cls_1
          },
          {
            name: '二分类#CLS#转折关系',
            type: 'line',
            data: this.lineData.bi_cls_2
          },
          {
            name: '二分类#MMP#并列关系',
            type: 'line',
            data: this.lineData.bi_pool_1
          },
          {
            name: '二分类#MMP#转折关系',
            type: 'line',
            data: this.lineData.bi_pool_2
          }
        ]
      };
      this.chartInstance.setOption(initOption);
    },
  }
}
</script>

<style scoped>
.el-row {
  margin-bottom: 5px;
}
.el-col {
  border-radius: 4px;
}
.step-font{
  font-weight: bold;
  font-family: 'Microsoft YaHei';
  margin-left: 0px;
  font-size: medium;
  color: dimgrey;
}
.el-divider {
  height: 1px;
  margin-top: 0px !important;
  margin-bottom: 10px !important;
}
.line-div {
  height: 90%;
  width: 100%;
  text-align: center;
}
.com-chart {
  width: 100%;
  height: 100%;
}
</style>
